Goodjamp/nrf52840Mouse_SDK15/nRF5_SDK_15.2.0_9412b96/examples/ble_peripheral/ble_app_hids_mouse/main.c
static uint8_t            m_sp_enc_advdata[BLE_GAP_ADV_SET_DATA_SIZE_MAX];          /**< Advertising data buffer. */
static ble_gap_adv_data_t m_sp_advdata_buf =                                        /**< Advertising data buffer descriptor. */
{
    .adv_data =
    {
        .p_data = m_sp_enc_advdata,
        .len    = sizeof(m_sp_enc_advdata)
    }
};
#endif

static void on_hids_evt(ble_hids_t * p_hids, ble_hids_evt_t * p_evt);

static void on_hids_evt(ble_hids_t * p_hids, ble_hids_evt_t * p_evt);
static void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context);
static void pm_evt_handler(pm_evt_t const * p_evt);
static void on_adv_evt(ble_adv_evt_t ble_adv_evt);
static void ble_advertising_error_handler(uint32_t nrf_error);
static void peer_list_get(pm_peer_id_t * p_peers, uint32_t * p_size);
static void sp_advdata_prepare(ble_advdata_t const * const p_new_advdata, ble_gap_adv_data_t  * const p_new_advdata_buf);


/**@brief Function for starting advertising for direct connect to device according order.
 *        This process include two phase: scanning, one item white list advertising
          - scanning:   high density advertising with rejection ALL input connection for detect device from white list around
          - connection: advertising with ONE WHITE LIST device and serially switch device on white list
          I should add state machine for global control advertising process: power on adv, normal adv and so on
          On processing of power On adv I should switch phase of adv.

 */



#include "fds.h"

#include "orderProcessing.h"
#include "systemTime.h"

#define DETECTED_DEV_FREE    0xFF
#define DIRECT_CONN_QUANTITY 0x3

#define FILE_ORDER                               0xBAAB  /* The ID of the file to write the records into. */
#define RECORD_KEY_ORDER                         0xABBA  /* A key for the second record. */

#define APP_ADV_GLOBAL_INTERVAL           0x0023      /**< Fast advertising interval (in units of 0.625 ms. This value corresponds to 21 ms.). */
#define APP_ADV_GLOBAL_TIMEOUT              60     /**< The duration of the fast advertising period (in seconds). */


#define APP_ADV_FAST_SCANING_INTERVAL           0x0023      /**< Fast advertising interval (in units of 0.625 ms. This value corresponds to 21 ms.). */
#define APP_ADV_FAST_SCANING_TIMEOUT                10     /**< The duration of the fast advertising period (in seconds). */

#define APP_ADV_FAST_CONNECT_INTERVAL           0x0023      /**< Fast advertising interval (in units of 0.625 ms. This value corresponds to 21 ms.). */
#define APP_ADV_FAST_CONNECT_TIMEOUT                10     /**< The duration of the fast advertising period (in seconds). */

#define APP_ADV_FAST_SEARCH_INTERVAL           0x0140      /**< Fast advertising interval (in units of 0.625 ms. This value corresponds to 200 ms.). */
#define APP_ADV_FAST_SEARCH_TIMEOUT                60     /**< The duration of the fast advertising period (in seconds). */

#define ORDER_FLASHE_PAGE                         254

#define ADV_RECONNECT_SCAN_TIMEOUT               10000

#define GET_PAGE_ADDRESS(X)  (uint32_t)(X*4096)


typedef enum
{
    ADV_PROC_START_CONNECT,
    ADV_PROC_STOP_ADV,
    ADV_PROC_CONNECT_PREV,
    ADV_PROC_CONNECT
}nrfBLEAdvEvT;

typedef enum
{
    DEV_SCANNING,
    DEV_CONNECTION,
}connPhase;

typedef enum
{
    ADV_IDLE,              // Mo advertising
    ADV_ADD_NEW,           // after press connect pushbutton
    ADV_RECONNECT_SCAN,    // after power on with bonds    OR after disconnect
    ADV_RECONNECT_CONNECT,
}advTypeT;

typedef enum
{
    CONNECTION_CONNECT          = 0x0,
    CONNECTION_START_DISCONNECT = 0x1,
    CONNECTION_DISCONNECT       = 0x2,
}connectionStateT;


struct
{
    connPhase phase;
    uint16_t  listDetectedDev[BLE_GAP_WHITELIST_ADDR_MAX_COUNT];
    uint8_t   quantityDetectedDev;
    uint8_t   connectCnt;
    uint8_t   loopCnt;
}advDirOrdConnState =
{
    .listDetectedDev = {[0 ... BLE_GAP_WHITELIST_ADDR_MAX_COUNT-1] = DETECTED_DEV_FREE}
};

orderT        deviceOrder;
timerCallbacT stopScanAdvTimerCallback;
timerCallbacT switchToConnAdvTimerCallback;
struct{
    bool             isDeleteBonds;
    bool             isRealAdv;
    bool             isAppAdv;
    bool             isPrevConn;
    uint16_t         connectionHandler;
    advTypeT         currentAdvType;
    connectionStateT connectState;
} appState =
{
    .isDeleteBonds    = false,                  // do we need clear bonds
    .isRealAdv        = false,                  // real state of advertising
    .isAppAdv         = false,                  // is advertising: true, false
    .isPrevConn       = false,                  // is current device was previous connected
    .connectionHandler = BLE_CONN_HANDLE_INVALID,
    .currentAdvType   = ADV_IDLE,               // current advertising state
    .connectState     = CONNECTION_DISCONNECT,  // current connection state
};
uint32_t scaningTimeout;

bool appAdvGetPrevConn(void)
{
    return appState.isPrevConn;
}


void appAdvSetPrevConn(bool prevConnSet)
{
    appState.isPrevConn = prevConnSet;
}


advTypeT appAdvGetCurrentType(void)
{
    return appState.currentAdvType;
}


bool appAdvGetState(void)
{
    return appState.isAppAdv;
}


void appAdvSetRealState(bool state)
{
    appState.isRealAdv = state;
}


void appConnectSetState(connectionStateT connState, uint16_t connectionHandler)
{
    appState.connectionHandler = connectionHandler;
    appState.connectState      = connState;
}

uint16_t appGetBLEPeers(void)
{
    pm_peer_id_t cntPeers[BLE_GAP_WHITELIST_ADDR_MAX_COUNT];
    uint32_t m_whitelist_peers = 0;
    uint32_t     pCnt = 0;
    memset(cntPeers, PM_PEER_ID_INVALID, sizeof(m_whitelist_peers));
    pCnt = (sizeof(cntPeers) / sizeof(pm_peer_id_t));
    peer_list_get(cntPeers, &pCnt);
    return pCnt;
}



void appDisconnect()
{
    ret_code_t ret;
    if(appState.connectState != CONNECTION_CONNECT)
    {
        NRF_LOG_INFO("DISCONNECT: disconnected");
        return;
    }
    NRF_LOG_INFO("DISCONNECT: start disconnect");
    appState.connectState = CONNECTION_START_DISCONNECT;
    appState.isRealAdv = true;
    ret = sd_ble_gap_disconnect(appState.connectionHandler, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
    NRF_LOG_INFO("DISCONNECT: ret = %d", ret);
    APP_ERROR_CHECK(ret);
    NRF_LOG_INFO("DISCONNECT: ok");
}


