Goodjamp/nrf52840Mouse_SDK15/nRF5_SDK_15.2.0_9412b96/examples/ble_peripheral/ble_app_hids_mouse/main.c
void appAdvStop(void)
{
    ret_code_t ret;
    NRF_LOG_INFO("ADV STOP:");
    switch(appState.connectState)
    {
    case CONNECTION_CONNECT:
        appState.isAppAdv = false;
        NRF_LOG_INFO("ADV STOP: already stoped");
        break;
    case CONNECTION_START_DISCONNECT:
        appState.isAppAdv = false;
        NRF_LOG_INFO("ADV STOP: disconnected process");
        break;
    case CONNECTION_DISCONNECT:
        appState.isAppAdv = false;
        if(!appState.isRealAdv)
        {
            NRF_LOG_INFO("ADV STOP: current stop");
            return;
        }
        appState.isRealAdv = false;
         ret = sd_ble_gap_adv_stop(m_advertising.adv_handle);
        //ret = sd_ble_gap_adv_stop(((ble_advertising_t *)&m_advertising)->adv_handle);
        NRF_LOG_INFO("ADV STOP: ret = %d", ret);
        APP_ERROR_CHECK(ret);
        NRF_LOG_INFO("ADV STOP: ok");
        break;
    default:
        break;
    }
    NRF_LOG_INFO("ADV STOP: ok");

}


void appAdvStart(void)
{
    ret_code_t ret;
    switch(appState.connectState)
    {
        case CONNECTION_CONNECT:
            // after disconnect nrf automatically start advertising
            appState.isAppAdv = true;
            NRF_LOG_INFO("ADV START: disconnect connection");
            //ret = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            appDisconnect();
            break;
        case CONNECTION_START_DISCONNECT:
            appState.isAppAdv = true;
            NRF_LOG_INFO("ADV START: wait disconnect");
            break;
        case CONNECTION_DISCONNECT:
            if(appState.isRealAdv)
            {
                NRF_LOG_INFO("ADV START: running state");
                break;
            }
            appState.isAppAdv  = true;
            appState.isRealAdv = true;
            NRF_LOG_INFO("ADV START: start");
            ret = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
            NRF_LOG_INFO("ADV START: ret = %d", ret);
            APP_ERROR_CHECK(ret);
            break;
        default: break;
    }
    NRF_LOG_INFO("ADV START: ok");
}

/*
static void advertising_init(uint16_t intervalMSeconds, uint16_t periodSeconds, bool whitelistEnabled)
{
    ret_code_t err_code;
    uint8_t    adv_flags;
    ble_advertising_init_t init;

    memset(&init, 0, sizeof(init));

    adv_flags                            = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;
    init.advdata.name_type               = BLE_ADVDATA_FULL_NAME;
    init.advdata.include_appearance      = true;
    init.advdata.flags                   = adv_flags;
    init.advdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    init.advdata.uuids_complete.p_uuids  = m_adv_uuids;

    init.config.ble_adv_on_disconnect_disabled = false;
    init.config.ble_adv_whitelist_enabled      = whitelistEnabled;
    init.config.ble_adv_directed_enabled       = false;
    init.config.ble_adv_directed_slow_enabled  = false;
    init.config.ble_adv_fast_enabled           = true;
    init.config.ble_adv_fast_interval          = intervalMSeconds;
    init.config.ble_adv_fast_timeout           = periodSeconds;
    init.config.ble_adv_slow_enabled           = false;


    init.evt_handler   = on_adv_evt;
    init.error_handler = ble_advertising_error_handler;

    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}


*/


static void advertising_init(uint16_t intervalMSeconds, uint16_t periodSeconds, bool whitelistEnabled)
{
    ret_code_t             err_code;
    uint8_t                adv_flags;
    ble_advertising_init_t init;

    memset(&init, 0, sizeof(init));

    adv_flags                            = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;
    init.advdata.name_type               = BLE_ADVDATA_FULL_NAME;
    init.advdata.include_appearance      = true;
    init.advdata.flags                   = adv_flags;
    init.advdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    init.advdata.uuids_complete.p_uuids  = m_adv_uuids;

    init.config.ble_adv_on_disconnect_disabled     = false;
    init.config.ble_adv_whitelist_enabled          = whitelistEnabled;
    init.config.ble_adv_directed_high_duty_enabled = false;
    init.config.ble_adv_directed_enabled           = false;
    init.config.ble_adv_directed_interval          = 0;
    init.config.ble_adv_directed_timeout           = 0;
    init.config.ble_adv_fast_enabled               = true;
    init.config.ble_adv_fast_interval              = intervalMSeconds;
    init.config.ble_adv_fast_timeout               = periodSeconds;
    init.config.ble_adv_slow_enabled               = false;
    init.config.ble_adv_slow_interval              = APP_ADV_SLOW_INTERVAL;
    init.config.ble_adv_slow_timeout               = APP_ADV_SLOW_DURATION;

    init.evt_handler   = on_adv_evt;
    init.error_handler = ble_advertising_error_handler;

    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);

#if SWIFT_PAIR_SUPPORTED == 1
    init.advdata.p_manuf_specific_data = &m_sp_manuf_advdata;
    sp_advdata_prepare(&init.advdata, &m_sp_advdata_buf);
#endif
}













bool appPeerGetIdInList(pm_peer_id_t peerIdIn)
{
    pm_peer_id_t peer_id;

    peer_id = pm_next_peer_id_get(PM_PEER_ID_INVALID);

    while (peer_id != PM_PEER_ID_INVALID )
    {
        if( peerIdIn == peer_id)
        {
            return true;
        }
        peer_id = pm_next_peer_id_get(peer_id);
    }
    return false;
}


static void appAdvSetStart(advTypeT advType, uint16_t peerId)
{
    ret_code_t ret;
    static pm_peer_id_t      m_whitelist_peers[BLE_GAP_WHITELIST_ADDR_MAX_COUNT];       /**< List of peers currently in the whitelist. */
    static uint32_t          m_whitelist_peer_cnt;                                      /**< Number of peers currently in the whitelist. */

