Goodjamp/nrf52840Mouse_SDK15/nRF5_SDK_15.2.0_9412b96/examples/ble_peripheral/ble_app_hids_mouse/main.c
    switch(advType)
    {
    case ADV_IDLE:
        NRF_LOG_INFO("ADV idle");
        appState.currentAdvType = ADV_IDLE;
        appAdvStop();
        return;
    case ADV_ADD_NEW: // advertising without white list, but REJECT connection all current peers
        NRF_LOG_INFO("ADV add new");
        timerStop(stopScanAdvTimerCallback);
        appState.currentAdvType = ADV_ADD_NEW;
        m_whitelist_peer_cnt = 0;
        break;
    case ADV_RECONNECT_SCAN:
        memset(m_whitelist_peers, PM_PEER_ID_INVALID, sizeof(m_whitelist_peers));
        m_whitelist_peer_cnt = (sizeof(m_whitelist_peers) / sizeof(pm_peer_id_t));
        peer_list_get(m_whitelist_peers, &m_whitelist_peer_cnt);

        NRF_LOG_INFO("Adv recon: %d", m_whitelist_peer_cnt);

        if(m_whitelist_peer_cnt == 0) // if no peer devices -
        {
            appState.currentAdvType = ADV_ADD_NEW;
        }
        else
        {
            appState.currentAdvType = ADV_RECONNECT_SCAN;
            timerRun(stopScanAdvTimerCallback, ADV_RECONNECT_SCAN_TIMEOUT);
            scaningTimeout = getTime();
        }
        break;
    case ADV_RECONNECT_CONNECT:
        appState.currentAdvType = ADV_RECONNECT_CONNECT;
        // set white list parameters
        NRF_LOG_INFO("Adv recon conn");
        m_whitelist_peers[0] = peerId;
        m_whitelist_peer_cnt = 1;
        break;
    default:
        break;
    }
    appAdvStop();  // use this stop adv for activate white list with new devices

    ret = pm_whitelist_set((m_whitelist_peer_cnt == 0 ) ? (NULL) : (m_whitelist_peers),
                           (m_whitelist_peer_cnt == 0 ) ? (0)    : (m_whitelist_peer_cnt));
    ret = pm_device_identities_list_set((m_whitelist_peer_cnt == 0 ) ? (NULL) : (m_whitelist_peers),
                                        (m_whitelist_peer_cnt == 0 ) ? (0)    : (m_whitelist_peer_cnt));
    NRF_LOG_INFO("ret = %d", ret);

    if (ret != NRF_ERROR_NOT_SUPPORTED)
    {
        APP_ERROR_CHECK(ret);
    }
    appAdvStart();
}


void appAdvAddNew(nrfBLEAdvEvT inEv, pm_peer_id_t peerId)
{
    switch(inEv)
    {
    case ADV_PROC_START_CONNECT:
        break;
    case ADV_PROC_STOP_ADV:
        break;
    case ADV_PROC_CONNECT_PREV:
        NRF_LOG_INFO("Disconnect old dev");
        appDisconnect();
        break;
    case ADV_PROC_CONNECT:
        NRF_LOG_INFO("No device on the list");
        appAdvStop();
        break;
    }

}


void appAdvDirectProc(nrfBLEAdvEvT inEv, pm_peer_id_t peerId)
{
    ret_code_t err_code;
    switch(inEv)
    {
    case ADV_PROC_START_CONNECT: // 1
        NRF_LOG_INFO("CONNECT");
        switch(advDirOrdConnState.phase)
        {
        case DEV_SCANNING:  // add device to the list of device that was detected
        {
            uint8_t pos;
            // disconnect input connection
            NRF_LOG_INFO("_SCANNING_");

            uint8_t cnt = 0;
            pm_peer_id_t m_whitelist_peers[BLE_GAP_WHITELIST_ADDR_MAX_COUNT];
            uint32_t     m_whitelist_peer_cnt = 0;
            memset(m_whitelist_peers, PM_PEER_ID_INVALID, sizeof(m_whitelist_peers));
            m_whitelist_peer_cnt = sizeof(m_whitelist_peers) / sizeof(pm_peer_id_t);
            peer_list_get(m_whitelist_peers, &m_whitelist_peer_cnt);
            for(; cnt < m_whitelist_peer_cnt; cnt++)
            {
                if(m_whitelist_peers[cnt] == peerId)
                {
                    break;
                }

            }
            if(cnt < m_whitelist_peer_cnt)
            {
                NRF_LOG_INFO("remove dev %d", m_whitelist_peers[cnt] );
                for(; cnt < (m_whitelist_peer_cnt - 1); cnt++)
                {
                    m_whitelist_peers[cnt] = m_whitelist_peers[cnt+1];//
                }
                m_whitelist_peer_cnt--;
                m_whitelist_peers[cnt] = PM_PEER_ID_INVALID;
                NRF_LOG_INFO("PDL quan %d", m_whitelist_peer_cnt);


                err_code = pm_whitelist_set((m_whitelist_peer_cnt == 0 ) ? (NULL) : (m_whitelist_peers),
                                       (m_whitelist_peer_cnt == 0 ) ? (0)    : (m_whitelist_peer_cnt));
                APP_ERROR_CHECK(err_code);
                // Setup the device identies list.
                // Some SoftDevices do not support this feature.
                err_code = pm_device_identities_list_set((m_whitelist_peer_cnt == 0 ) ? (NULL) : (m_whitelist_peers),
                                                    (m_whitelist_peer_cnt == 0 ) ? (0)    : (m_whitelist_peer_cnt));
                APP_ERROR_CHECK(err_code);
            }
            //disconnect current device
            appDisconnect();

            NRF_LOG_INFO("--------Dev in list ? %d", peerId);
            if(orderGetPos(deviceOrder, peerId, &pos))
            {
                NRF_LOG_INFO("Dev find %d  %d ", peerId, pos);
                if(advDirOrdConnState.listDetectedDev[pos] == DETECTED_DEV_FREE)
                {
                    NRF_LOG_INFO("Dev save");
                    advDirOrdConnState.listDetectedDev[pos] = peerId;
                    advDirOrdConnState.quantityDetectedDev++;
                }
            }
            if(advDirOrdConnState.quantityDetectedDev >= orderGetQuantity(deviceOrder))
            {
                NRF_LOG_INFO("---------SCANED TIME = %d", getTime() - scaningTimeout);
                appAdvStop();
            }
        }
        break;
        case DEV_CONNECTION:// DO NOTHING (continue connection processing)
            /*DISCONNECT CURRENT DEVICE IF IT PEER ID DON'T EQUAL CURRENT DEVICE FROM WHITE LIST !!!! */
            NRF_LOG_INFO("_CONNECTION_");
            appAdvStop();
            break;
        }
        break;
    case ADV_PROC_STOP_ADV:
        NRF_LOG_INFO("STOP_ADV");
        switch(advDirOrdConnState.phase)
        {
        case DEV_SCANNING: // stop adv for previous phase and start connection to detected devices
        {
            uint8_t cnt_1 = 0;
            uint8_t cnt_2 = 0;
            NRF_LOG_INFO("_SCANNING_");
            NRF_LOG_INFO("Find %d", advDirOrdConnState.quantityDetectedDev);
            // if device wasn't detected  start adv again
            if(advDirOrdConnState.quantityDetectedDev == 0)
            {
                appAdvSetStart(ADV_RECONNECT_SCAN , 0);
                break;
            }
            // shift all devices on list UP
            for(cnt_1 = 0; cnt_1 < BLE_GAP_WHITELIST_ADDR_MAX_COUNT - 1; cnt_1++)
            {
                for(cnt_2 = BLE_GAP_WHITELIST_ADDR_MAX_COUNT-1; cnt_2 > 0; cnt_2--)
                {
                    if(advDirOrdConnState.listDetectedDev[cnt_2 - 1] == DETECTED_DEV_FREE &&
                            advDirOrdConnState.listDetectedDev[cnt_2 ]    != DETECTED_DEV_FREE)
                    {
                        advDirOrdConnState.listDetectedDev[cnt_2 - 1] = advDirOrdConnState.listDetectedDev[cnt_2 ];
                        advDirOrdConnState.listDetectedDev[cnt_2 ]    = DETECTED_DEV_FREE;
                    }
                }
            }

            advDirOrdConnState.connectCnt = 0;
            NRF_LOG_INFO("+++++++++");
            appAdvSetStart(ADV_RECONNECT_CONNECT , advDirOrdConnState.listDetectedDev[advDirOrdConnState.connectCnt]);
            NRF_LOG_INFO("---------");
            advDirOrdConnState.phase = DEV_CONNECTION;
        }
        break;
        case DEV_CONNECTION:   /*
            on this point I can go in two cases:
            - current device from WL was not able connect
            - LAST DEVICE THAT WAS IN CONNECT-> DISACONNECT STATE BEFOR STOP SCANNIN WAS DISCONNECTED

            */
            NRF_LOG_INFO("_CONNECTION_");
            if(advDirOrdConnState.connectCnt >= advDirOrdConnState.quantityDetectedDev)
            {

