Goodjamp/nrf52840Mouse_SDK15/nRF5_SDK_15.2.0_9412b96/examples/ble_peripheral/ble_app_hids_mouse/main.c
                advDirOrdConnState.loopCnt++;

                if(advDirOrdConnState.loopCnt >= DIRECT_CONN_QUANTITY)
                {
                    // start general advertising
                    break;
                }
                // start scanning again
                memset(advDirOrdConnState.listDetectedDev, DETECTED_DEV_FREE, sizeof(advDirOrdConnState.listDetectedDev));
                advDirOrdConnState.connectCnt = 0;
                advDirOrdConnState.phase      = DEV_SCANNING;
                appAdvSetStart(ADV_RECONNECT_SCAN, 0);
            }
            // shift to next detected device
            advDirOrdConnState.connectCnt++;
            appAdvSetStart(ADV_RECONNECT_CONNECT, advDirOrdConnState.listDetectedDev[advDirOrdConnState.connectCnt]);
            break;
        }
        break;
    default:
        break;
    }
}


void appAdvProcessing(nrfBLEAdvEvT inEv, pm_peer_id_t peerId)
{
    switch(appState.currentAdvType)
    {
    case ADV_ADD_NEW:
        NRF_LOG_INFO("ADV_ADD_NEW");
        appAdvAddNew(inEv, peerId);
        break;
    case ADV_RECONNECT_SCAN:
        NRF_LOG_INFO("ADV_SCAN");
        appAdvDirectProc(inEv, peerId);
        break;
    case ADV_RECONNECT_CONNECT:
        NRF_LOG_INFO("ADV_CONNECT");
        appAdvDirectProc(inEv, peerId);
        break;
    default:
        break;
    }
}


void appAdvScanStopCB(void)
{
    NRF_LOG_INFO("Stop Scan");
    appAdvStop();
    appAdvProcessing(ADV_PROC_STOP_ADV, 0);
}

/**@brief Clear bond information from persistent storage.
 */
static void delete_bonds(void)
{
    ret_code_t err_code;

    NRF_LOG_INFO("Erase bonds!");

    err_code = pm_peers_delete();
    NRF_LOG_INFO("DELETE ERR %d", err_code);
    APP_ERROR_CHECK(err_code);
}


void appProcessing(void)
{
    // start/stop adv processing
    if(appState.isAppAdv != appState.isRealAdv)
    {
        if(appState.isAppAdv)
        {
            appAdvStart();
        }
        else
        {
            appAdvStop();
        }
    }

    //delete bonds
    if(appState.isDeleteBonds &&  appState.connectState == CONNECTION_DISCONNECT)
    {
        appState.isDeleteBonds = false;
        timerStop(stopScanAdvTimerCallback);
        NRF_LOG_INFO("Clear bonds");
        appAdvSetStart(ADV_IDLE, 0);
        delete_bonds();
        advertising_init(APP_ADV_GLOBAL_INTERVAL, APP_ADV_GLOBAL_TIMEOUT, true);
        orderClean(deviceOrder);
        orderWriteFlash(deviceOrder, GET_PAGE_ADDRESS(ORDER_FLASHE_PAGE));
        NRF_LOG_INFO("Numm peers = %d", appGetBLEPeers());
    }
}


void flashMemWriteBytes(uint32_t flashAddress, uint8_t buffer[], uint32_t bufferSize)
{
    fds_record_t        record;
    fds_record_desc_t   record_desc;
    // Set up record.
    record.file_id           = FILE_ORDER;
    record.key               = RECORD_KEY_ORDER;
    record.data.p_data       = buffer;
    record.data.length_words = (bufferSize+ 3) / 4;
    ret_code_t ret;
    fds_find_token_t    ftok;

    /* It is required to zero the token before first use. */
    memset(&ftok, 0x00, sizeof(fds_find_token_t));

    // delete all previous records with the same KEY and ID
    while (fds_record_find(FILE_ORDER, RECORD_KEY_ORDER, &record_desc, &ftok) == FDS_SUCCESS)
    {
        ret = fds_record_delete(&record_desc);
        if (ret != FDS_SUCCESS)
        {
        /* Error. */
        }
    }
    ret = fds_record_write(&record_desc, &record);
    if (ret != FDS_SUCCESS)
    {
        /* Handle error. */
    }
}


void flashMemReadBytes(uint32_t flashAddress, uint8_t buffer[], uint32_t bufferSize)
{
    fds_flash_record_t  flash_record;
    fds_record_desc_t   record_desc;
    fds_find_token_t    ftok;

    /* It is required to zero the token before first use. */
    memset(&ftok, 0x00, sizeof(fds_find_token_t));
    /* Loop until all records with the given key and file ID have been found. */
    // while (fds_record_find(FILE_ORDER, RECORD_KEY_ORDER, &record_desc, &ftok) == FDS_SUCCESS)
    while (fds_record_find(FILE_ORDER, RECORD_KEY_ORDER, &record_desc, &ftok) == FDS_SUCCESS)
    {
        NRF_LOG_INFO("Read start");
        if (fds_record_open(&record_desc, &flash_record) != FDS_SUCCESS)
        {
            /* Handle error. */
        }

        memcpy(buffer, (uint8_t*)flash_record.p_data, bufferSize);

        /* Access the record through the flash_record structure. */
        /* Close the record when done. */
        if (fds_record_close(&record_desc) != FDS_SUCCESS)
        {
            /* Handle error. */
        }
    }
    NRF_LOG_INFO("Read End");
}


/**@brief Fetch the list of peer manager peer IDs.
 *
 * @param[inout] p_peers   The buffer where to store the list of peer IDs.
 * @param[inout] p_size    In: The size of the @p p_peers buffer.
 *                         Out: The number of peers copied in the buffer.
 */
static void peer_list_get(pm_peer_id_t * p_peers, uint32_t * p_size)
{
    pm_peer_id_t peer_id;
    uint32_t     peers_to_copy;

    peers_to_copy = (*p_size < BLE_GAP_WHITELIST_ADDR_MAX_COUNT) ?
                     *p_size : BLE_GAP_WHITELIST_ADDR_MAX_COUNT;

    peer_id = pm_next_peer_id_get(PM_PEER_ID_INVALID);
    *p_size = 0;

    while ((peer_id != PM_PEER_ID_INVALID) && (peers_to_copy--))
    {
        p_peers[(*p_size)++] = peer_id;
        peer_id = pm_next_peer_id_get(peer_id);
    }
}





/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in]   line_num   Line number of the failing ASSERT call.
 * @param[in]   file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**@brief Function for setting filtered whitelist.
 *
 * @param[in] skip  Filter passed to @ref pm_peer_id_list.
 */
static void whitelist_set(pm_peer_id_list_skip_t skip)
{
    pm_peer_id_t peer_ids[BLE_GAP_WHITELIST_ADDR_MAX_COUNT];
    uint32_t     peer_id_count = BLE_GAP_WHITELIST_ADDR_MAX_COUNT;

    ret_code_t err_code = pm_peer_id_list(peer_ids, &peer_id_count, PM_PEER_ID_INVALID, skip);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_INFO("\tm_whitelist_peer_cnt %d, MAX_PEERS_WLIST %d",
                   peer_id_count + 1,
                   BLE_GAP_WHITELIST_ADDR_MAX_COUNT);

    err_code = pm_whitelist_set(peer_ids, peer_id_count);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for setting filtered device identities.
 *
 * @param[in] skip  Filter passed to @ref pm_peer_id_list.
 */
static void identities_set(pm_peer_id_list_skip_t skip)
{
    pm_peer_id_t peer_ids[BLE_GAP_DEVICE_IDENTITIES_MAX_COUNT];
    uint32_t     peer_id_count = BLE_GAP_DEVICE_IDENTITIES_MAX_COUNT;

    ret_code_t err_code = pm_peer_id_list(peer_ids, &peer_id_count, PM_PEER_ID_INVALID, skip);
    APP_ERROR_CHECK(err_code);

    err_code = pm_device_identities_list_set(peer_ids, peer_id_count);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for starting advertising.
 */
static void advertising_start(bool erase_bonds)
{
    if (erase_bonds == true)
    {
        delete_bonds();
        // Advertising is started by PM_EVT_PEERS_DELETE_SUCCEEDED event.
    }
    else
    {
        whitelist_set(PM_PEER_ID_LIST_SKIP_NO_ID_ADDR);

